{
	"Reviews": [{
		"Ratings": {
			"Service": "1",
			"Cleanliness": "1",
			"Overall": "1.0",
			"Value": "1",
			"Sleep Quality": "1",
			"Rooms": "1",
			"Location": "5"
		},
		"AuthorLocation": "Arlington, WA",
		"Title": "“You've got to be kidding me??!”",
		"Author": "luvsroadtrips",
		"ReviewID": "UR122476164",
		"Content": "This place is not even suitable for the homeless take my advice and stay far far away! We booked only because every where else in town was full and looked at the last review and thought ok great location and comfortable beds, made all the previous ones seem possibly an exageration. NOT AT ALL people believe me you will hate this place! Upon arrival we were greated by a woman that could not speak english hardly at all, unable to answer our questions about the age of the hotel, parking, etc. Upon check in we got our room keys and were placed on the 9th floor on the way up the elevator which sounded horrible BTW the elevator stopped on the 2nd floor to pick up another rider going up, I about vomited right there the carpet was so terribly stained and the smell emitting from that floor was horrible, We made it to the 9th and although stained carpet not even half as bad as the 2nd floor we were a bit more hopeful. We booked a standard double room, and that's what you get, a tiny double sized bed, old linens, filthy carpet, gross tiny bathroom but we had running water and heat so decided to make the most of it. We all (2 couples 2 rooms) headed out on the town upon arriving back at our hotel, the elevator was out of service we were told the stairs were our only choice, 9 stories later exhausted we finally made it to our rooms and literally fell exhausted into our beds, we awoke the next morning only to learn the elevator was still out of service, meaning we got to haul all our luggage down 9 floors, filthy staircase and something all over the stairs of the 4th to the 2nd floor made it treacherous as well. Today being 4 days later my muscles still ache I've yet to hear back from the manager (we requested some sort of a discount) I'm betting we won't hear back and we chalk it up to learning the hard way. I'd much rather stay in a hostel or sleep in a park then ever step foot in this horrid excuse for a hotel again!!!! GROSS...... seriously need a hazmat suit to enter.",
		"Date": "January 3, 2012"
	},
	{
		"Ratings": {
			"Service": "4",
			"Cleanliness": "4",
			"Overall": "4.0",
			"Value": "3",
			"Sleep Quality": "5",
			"Rooms": "3",
			"Location": "5"
		},
		"AuthorLocation": "Vancouver, Canada",
		"Title": "“great service, comfortable rooms, easy stay.”",
		"Author": "estelle e",
		"ReviewID": "UR122239883",
		"Content": "We stayed in downtown hotel Seattle for two night. Beds were very comfortable. Rooms wee very clean. Just minutes away from union street and 5th avenue. Starucks coffee next door. 24 hour room service was extremely friendly and helpful. We ordered pizza to our hotel at 12am. we had a good experience.",
		"Date": "December 29, 2011"
	},
	{
		"Ratings": {
			"Service": "1",
			"Cleanliness": "2",
			"Overall": "1.0",
			"Value": "1",
			"Sleep Quality": "1",
			"Rooms": "1",
			"Location": "1"
		},
		"AuthorLocation": "San Diego, California",
		"Title": "“WTF!!!!!”",
		"Author": "RobertEddy",
		"ReviewID": "UR121931325",
		"Content": "i made reservations and when i showed up, i quickly started laughing at how pathetic is was. first, they didnt even have parking near the hotel. second, i asked if they had wi-fi and they replied enthusiastically,\" we have it in the lobby!\" how is that even a perk? finally, i said screw this place for these rates and left. the manager offered other places and followed me to the door. the next day, they charged me for the reserved room and said that i was a no show! the people are rude and have not given my money back yet. they should post their business as a motel at the very least! all i can say is never again!",
		"Date": "December 20, 2011"
	},
	{
		"Ratings": {
			"Service": "1",
			"Cleanliness": "1",
			"Overall": "1.0",
			"Value": "1",
			"Sleep Quality": "1",
			"Rooms": "1",
			"Location": "1"
		},
		"AuthorLocation": "Chicago, Illinois",
		"Title": "“Do Not Stay Here”",
		"Author": "James R",
		"ReviewID": "UR119896310",
		"Content": "This hotel is so bad it's a joke. I could barely sleep because the place is so ghetto, you sit in your room worried about your safety and your valuables. The elevator crawls up squeeking the whole way with no certificate of inspection or weight limit posted. The room looks like somethig out of the 70s. Holes in the sheets, no toilet paper roll, just sitting on the sink, an old water furnace with peeling paint (is it lead based?). The TV has about 5 working chanels and has a hole in the plastic. The wiring is obviously shoddy and I found a working outlet on my third try. The heat runs so hot and does not adjust. You have to open a window. The window has no screen and I was on the 8th floor (Do Not stay here with a child). The wallpaper was badly peeling, exposing mold and mildew on the walls. I can only imagine how poor the air quality was. No WiFi in the room. The neighbors next to me were having relations loudly and the walls are paper thin. After hearing the walls bang for a few minutes, I had to get some fresh air. The surrounding area is full of homeless and shady characters. There is a terrible bar in the basement that attracts scumbags and white trash who hang out in front of the entrance. The thing is, this room cost me $95!!! I've got great hotels in other major cities, Chicago, NY, Orlando for this range that are great. This is a Roach Motel that is best suited for drug use and prostitution. It should offer hourly rates. I took off my watch and ring just to make sure no one was casing me out. The worst part is that the website is completely misleading. Any positive reviews seem like ownership tring to do damage control on the reviews.",
		"Date": "October 30, 2011"
	},
	{
		"Ratings": {
			"Location": "5",
			"Overall": "1.0",
			"Value": "3",
			"Service": "1",
			"Rooms": "1"
		},
		"AuthorLocation": "Mumbai (Bombay), India",
		"Title": "“bad experience”",
		"Author": "Shobha49",
		"ReviewID": "UR118110693",
		"Content": "My husband and I stayed at this hotel from 16th July to 18th July. We selected this hotel purely for the excellent location and for the cost. But frankly we were in for a shock when we arrived at the hotel directly after disembarking from a cruise. There was only one person at the front desk and he bluntly told us that check-in was only after 3pm. Since it was a long wait (we reached the hotel at 11am) we requested that we be allowed to leave our luggage. Luckily he agreed., So we left and returned only later in the evening. There was only one lift and that was so ancient just like everythinhg at the hotel. The room was smelling awful and looked very dull and unwelcoming. There was free wifi only in the lobby. The bathroom was only just adequate as the toilet seat was wobbly and almost broken. There was no kettle or microwave anywhere in the hotel. We just managed to survive for two nights only because it was conveniently located to the Pyke Marketplace ,space needle and the sea front. Luckily there were good restaurants and Starbucks close by . I will think twice before staying again at this hotel",
		"Date": "September 14, 2011"
	},
	{
		"Ratings": {
			"Cleanliness": "4",
			"Sleep Quality": "3",
			"Overall": "3.0",
			"Value": "3",
			"Service": "4"
		},
		"AuthorLocation": "Washington, DC",
		"Title": "“Basic & affordable”",
		"Author": "PalomitaBlanca",
		"ReviewID": "UR117757669",
		"Content": "Very basic hotel and good rate compared to most of the hotels in the area. Stayed here for 3 nights. Excellent staff that was very friendly and helpful. Very central to everything in downtown Seattle. Could definitely use a revamp (lobby, bedrooms, bathrooms, etc). Nonetheless I'd stay here again because the price was very affordable.",
		"Date": "September 6, 2011"
	},
	{
		"Ratings": {
			"Cleanliness": "4",
			"Sleep Quality": "4",
			"Overall": "4.0",
			"Value": "5",
			"Service": "4"
		},
		"AuthorLocation": "Bullhead CIty, AZ",
		"Title": "“Not bad place, given the price!”",
		"Author": "Qualnurse",
		"ReviewID": "UR117730450",
		"Content": "We stayed for one night, before a cruise to Alaska leaving from Seattle. We had previously stayed at the Warwick, and this hotel did not have near the same comfort level, but was still very comfortable and within walking distance of Pikes Placed market and other downtown attractions. We will definitely stay again!",
		"Date": "September 6, 2011"
	},
	{
		"Ratings": {
			"Cleanliness": "2",
			"Sleep Quality": "2",
			"Overall": "1.0",
			"Value": "1",
			"Service": "2"
		},
		"AuthorLocation": "llithonia",
		"Title": "“Hell”",
		"Author": "Debbie R",
		"ReviewID": "UR117303221",
		"Content": "Stay here if you want to experenice hell. Joel is the manger,an know help want so ever. Put me on the 10th floor even though he knew I don't like elevators. Then told the staff not to move me.",
		"Date": "August 27, 2011"
	},
	{
		"Ratings": {
			"Cleanliness": "4",
			"Sleep Quality": "3",
			"Overall": "3.0",
			"Value": "4",
			"Service": "4"
		},
		"AuthorLocation": "Singapore, Singapore",
		"Title": "“Basic hotel in a great location”",
		"Author": "travelitch_gal",
		"ReviewID": "UR117119391",
		"Content": "If you are looking for a value for money hotel, this would be it. It is a no frills hotel. The room and bathroom are clean. You can only use the wifi at the hotel lobby so it is rather troublesome if you need the Internet frequently. The staff are friendly too so that is a plus.",
		"Date": "August 23, 2011"
	},
	{
		"Ratings": {
			"Cleanliness": "5",
			"Sleep Quality": "5",
			"Overall": "4.0",
			"Value": "5",
			"Service": "4"
		},
		"AuthorLocation": "Wenatchee, Washington",
		"Title": "“Would definately stay here again!”",
		"Author": "Khaap",
		"ReviewID": "UR116501344",
		"Content": "This hotel had character! I really liked our room too. It was tiny but fun. Very well decorated and the bed was very comfortable. If you need space to spread out this isn't the place for you but if you plan on enjoying the room just as a place to drop your things and go enjoy the city than this is the perfect place. The location was fantastic and the staff was friendly and helpful. The hallways made me feel like I was in a dream. I loved the decor!! Very artistic, not like any other place I have ever stayed. I was a little concerned because I had seen that this hotel was listed on the bed bug report. I called ahead of time to inquire about this issue. I spoke to the general manager who told me that bed bugs have now come to Seattle and they are a problem in the industry and any hotel at any time could have them. He also assured me that they bring in dogs to check the rooms on a regular basis and if any are found they are properly exterminated. I don't think you can ask for anything else. We had no bed bugs in our room! Yea! Anyhow the place is great! I would go back for sure. Give them a try.",
		"Date": "August 10, 2011"
	},
	{
		"Ratings": {
			"Cleanliness": "1",
			"Sleep Quality": "1",
			"Overall": "1.0",
			"Value": "1",
			"Service": "1"
		},
		"AuthorLocation": "Huntsville, Alabama",
		"Title": "“You'd love this hotel if...”",
		"Author": "Trini007",
		"ReviewID": "UR115948833",
		"Content": "If old, torn and stained linen, towels, bedsheets gives you a thrill, you'd love this hotel. If you never iron your clothes, youd love this hotel as there are no irons in the rooms. If you feel that rusted bathroom and showers that dont work gives you an excellent reason to skip a shower, you'd love this hotel. If you think that a hotel that has no airconditioning in the rooms is a great opportunity to get fresh air, you'd love this hotel. If you think that having only 3 channels on tv to choose from is great, you'd love this hotel. If you think that \"identify that carpet stain\" is a great game to play with family and friends, you'd love this hotel. If you think that massive holes in the ceiling and walls in the room means that our dear rodents friends wont be bored or hungry, you'll love this hotel. I could go on, but I think you get the picture here.",
		"Date": "July 29, 2011"
	},
	{
		"Ratings": {
			"Cleanliness": "2",
			"Sleep Quality": "3",
			"Overall": "2.0",
			"Value": "3",
			"Service": "3"
		},
		"AuthorLocation": "Machynlleth, United Kingdom",
		"Title": "“Cheap and central.”",
		"Author": "rtl2",
		"ReviewID": "UR115478061",
		"Content": "The hotel is in a very convenient location, just a few steps from the University Street stop on the transit tunnel for free city centre busses or light rail. The price was very reasonable. The hotel was clean with regards to day to day cleaning - the lobby, corridors, toilet, shower were all clean, and the room was dust free with fresh smelling sheets on the bed, which whilst it was not the most comfy bed I have ever slept in it was OK. Deeper down bits of the hotel have seen better days. There was a rusty pipe and loose wallpaper in the corner of both my friends bathroom and my bathroom, both of our bathrooms had filthy suspended ceilings, there was also a bit of loose wallpaper in my bedroom and the TVs only worked on a few channels, in my room only one non religious channel in fact, and that was the \"Opra Winfrey Network\" - could not get any morning weather or news. Also the Wifi was in the loby only and it was a nightmare - the man on reception had to keep resetting the router. No breakfast in the hotel, they reccomend you go to the restaurant underneath for breakfast but it sounded expensive to us so we went to a nearby Subway instead. This hotel was OK for us for the price as we spent very little time in the hotel except when asleep. I would not have wanted to spend an extended amount of time in the room though.",
		"Date": "July 18, 2011"
	},
	{
		"Ratings": {
			"Cleanliness": "1",
			"Sleep Quality": "2",
			"Overall": "1.0",
			"Value": "1",
			"Service": "1"
		},
		"AuthorLocation": "Portland, Oregon",
		"Title": "“Awful, Simply Awful”",
		"Author": "PDXKev",
		"ReviewID": "UR112081499",
		"Content": "I stayed here overnight after attending the U2 concert recently. It was really bad! They didn't even have an alarm clock in the room. It's way overpriced. About the only thing good is that the location is quite convenient.",
		"Date": "June 7, 2011"
	},
	{
		"Ratings": {
			"Service": "1",
			"Cleanliness": "2",
			"Overall": "1.0",
			"Value": "1",
			"Sleep Quality": "2",
			"Rooms": "1",
			"Location": "5"
		},
		"AuthorLocation": "Rupert, Idaho",
		"Title": "“Not worth it.”",
		"Author": "lindseypie",
		"ReviewID": "UR109391596",
		"Content": "My husband and I decided to stay at Hotel Seattle because of the price and the location. But in the end, it probably would have been cheaper for us to stay at one of the nicer hotels a block over. There's no parking at this hotel, which meant we had to spend 30 bucks at a parking garage. Also, there's no internet in the rooms and our T.V. didn't work. Definitely a BIG disappointment.",
		"Date": "May 22, 2011"
	},
	{
		"Ratings": {
			"Service": "1",
			"Cleanliness": "1",
			"Overall": "1.0",
			"Value": "1",
			"Sleep Quality": "1",
			"Rooms": "1",
			"Location": "3"
		},
		"AuthorLocation": "New York, New York",
		"Title": "“I don't know where to start...”",
		"Author": "MaxStevens101",
		"ReviewID": "UR104384177",
		"Content": "I am just a college student visiting Seattle, and without looking into greater detail about the hotel I was making reservations with, I got stuck with Hotel Seattle. I stayed one out of two nights, and raised hell to get my money back for the second night. Again- MOLD in the bathroom. the shower backing was coming off the wall, and inside was disgusting, horrible cultures of something I don't know. Like a previous woman stated, I was terrified to sleep with the lights off. I didn't feel safe AT ALL. The entire place was creepy- the lobby is falling apart, the elevator you don't know if it's going to hold you; I felt genuinely scared and uncomfortable. When I got to my room, the windows were open and the oil heater was on. I couldn't figure out how to turn it off and suffocated in a hot room when I went to sleep. Eventually had to re-open the windows to hear the loud sirens, trash dumping noises, and strange animal cries at 2 AM. There are NO SCREENS on the windows, so YES, YOU OR YOUR KIDS COULD FALL OUT OF THE WINDOWS. Is that legal? I don't know. There was a metal object in my sheets, the sheets didn't even fit on the bed, the shower water was inconsistent, the bathroom dirty and hot, the hotel service TERRIBLE, holes in the walls, and cracks in the ceilings. The guy acted like I was crazy for asking for a refund. No one was friendly to me. I will never step foot in this terrible place ever again, not to be paid even, as someone else said. No sleep will be gotten here, just a stiff neck and a load of anxiety about the safety of you and your things. Spend a little more for a hotel you can feel safe in. No human being deserves to stay in such a mold-infested dump. OH YEAH- pay $10 for wifi for one day.",
		"Date": "April 17, 2011"
	},
	{
		"Ratings": {
			"Overall": "1.0",
			"Service": "1"
		},
		"AuthorLocation": "Denver, Colorado",
		"Title": "“Horrible Customer Service”",
		"Author": "jcoken",
		"ReviewID": "UR104097191",
		"Content": "I would never do business with this hotel. I had a room booked for Friday night because the Marriott was unavailable. Turns out that they had a hotel room and I was able to stay. I called the Hotel Seattle at 10:00pm the night before and they refused to cancel my room. Yes their check in policy is 2:00pm and yes I was 8 hours late, but generally most hotels, who rely on travelers to book their rooms, are more than happy to work with you. Unfortunately not these guys.",
		"Date": "April 15, 2011"
	},
	{
		"Ratings": {
			"Service": "1",
			"Cleanliness": "1",
			"Overall": "1.0",
			"Value": "1",
			"Sleep Quality": "1",
			"Rooms": "1",
			"Location": "2"
		},
		"AuthorLocation": "Fort Lauderdale, Florida",
		"Title": "“Run, just Run”",
		"Author": "SQLTravller",
		"ReviewID": "UR87400346",
		"Content": "I was unfortunately booked into this dump by my corporate travel office, I have filed a human rights complaint. This place was probably a dump 20 years ago, its better days are long gone. DO NOT PAY TO STAY HERE, there are nice hotel in the area for comparable rates.",
		"Date": "November 17, 2010"
	},
	{
		"Ratings": {
			"Overall": "1.0"
		},
		"AuthorLocation": "Laguna Beach, California",
		"Title": "“Hotel Creepy”",
		"Author": "RTiara",
		"ReviewID": "UR80212760",
		"Content": "I called my husband in a panic before I even got in the elevator. The lobby was creepy, dark, old and in need of repair. My room had lights that stopped working in the bathroom, carpet was dirty, tv did not work, and the carpet was dingy. I was afraid to sleep with the lights off. The street noise is so loud I could not sleep all night. When I opened the curtains in the morning, the curtain rod came loose. If I hadnt already paid for the room on a discount website that showed pictures of a newly remodeled hotel room, I would have never stayed.... I wish I had read previous reviews before I came to Seattle.",
		"Date": "September 19, 2010"
	},
	{
		"Ratings": {
			"Service": "1",
			"Cleanliness": "1",
			"Overall": "1.0",
			"Value": "1",
			"Sleep Quality": "1",
			"Rooms": "1",
			"Location": "4"
		},
		"AuthorLocation": "Atlanta",
		"Title": "“Hotel Twilight Zone”",
		"Author": "ATL012",
		"ReviewID": "UR78164165",
		"Content": "We checked in, saw the room and checked back out. I can't add anymore to the description of the ugly, mold infested, creepy room than what has already been said from other reviewers. But I can tell you that it wasn't easy to find another hotel room on a Saturday afternoon. After calling nearly every hotel downton, we lucked out and wound up paying over $200 for the last room available at the Hampton Inn (which was beautiful). But I still shudder at the memory of my very short stay at the Hotel Seattle.",
		"Date": "September 3, 2010"
	},
	{
		"Ratings": {
			"Service": "1",
			"Cleanliness": "2",
			"Overall": "1.0",
			"Value": "1",
			"Sleep Quality": "1",
			"Rooms": "1",
			"Location": "4"
		},
		"AuthorLocation": "San Diego, California",
		"Title": "“DO NOT STAY HERE!!!”",
		"Author": "IRIS54",
		"ReviewID": "UR77871111",
		"Content": "I read the reviewsâ€¦they weren't goodâ€¦but I thought, well, its just a couple of nights and we will be out and about most of the day...what I didn't remember is this is the only place where we can go home and rest...and its not a place I would recommend to go and relax, it small, dingy, old and not conducive to relaxing. There are only two hard backed chairs in the room to sit on; otherwise there is only the bed. This hotel in general needs TLC. We observed unfinished repair projects which showed wires sticking out of the light indicator above elevator, unfinished \"window transom\" above lobby entrance, and lots of little things that wouldn't take much time to finish to give hotel a nicer appearance. Some things were just annoying like the only useful plug-in for an equally useless hairdryer (which you have to check out at the desk, I think they only have one) is on the FAR opposite wall from the mirror in the bathroom. The noise from the hallway sounds as if the people in the hall are in your room with you. It is enough to say the staff could give a rip!!! This attitude just trickles down from the manager so forget about appealing to someone higher up. All in all, not only would I not recommend this hotel for any kind of stay, I would picket it if I lived in Seattle to save people from checking in!!!",
		"Date": "September 1, 2010"
	},
	{
		"Ratings": {
			"Service": "1",
			"Cleanliness": "1",
			"Overall": "1.0",
			"Value": "1",
			"Location": "5",
			"Rooms": "1"
		},
		"AuthorLocation": "NorCal",
		"Title": "“Astonishingly pathetic fleabag. Words fail me.”",
		"Author": "IamTooch",
		"ReviewID": "UR43920748",
		"Content": "Downtown was pretty full for Penny Arcade Expo, so we spent three nights here. Every facet of our experience was so comically bad I was waiting for the cameras. The bathroon vanity was falling apart. The bathroom crown moulding WAS mold. There was no water pressure in the morning! I mean, how is that possible? I kept my socks on whenever I was on the carpet. The \"restaurant\" in the basement took almost an hour to serve scrambled eggs and pancakes to us in an empty room. Why go on? If you can't find a room downtown for your trip, convention, what have you, you're better off staying at the airport or uptown and catching an express bus (or soon the Link light rail).",
		"Date": "September 23, 2009"
	},
	{
		"Ratings": {
			"Service": "2",
			"Cleanliness": "2",
			"Overall": "1.0",
			"Value": "2",
			"Location": "5",
			"Rooms": "2"
		},
		"AuthorLocation": "Tampa, FL",
		"Title": "“Wow. And NOT in a good way.”",
		"Author": "ErinmarieX",
		"ReviewID": "UR36594896",
		"Content": "The location was great but that's about it. The whole hotel basically looks like every piece of furniture and accessory were taken from a trash bin and placed at the Hotel. We even asked the Front desk person about why a Hotel that has the potential to be amazing (The old building alone is reason to want to preserve this place) and he seemed to care less - though in his defense I'm certain he gets that question a lot. My partner and one of our friends are both 6'5\" and the beds were so small that parts of their legs were hanging off the edge of the bed. Bathroom was incredibly small and slightly dirty. Again location was GREAT! It's a shame really... Luckily we just needed the room for one night as our cruise left the next day. Thankfully.",
		"Date": "August 3, 2009"
	},
	{
		"Ratings": {
			"Service": "2",
			"Cleanliness": "1",
			"Overall": "1.0",
			"Value": "1",
			"Location": "3",
			"Rooms": "1"
		},
		"AuthorLocation": "Washington",
		"Title": "“The worst hotel I've ever stayed in!!!!!”",
		"Author": "aspenkmc",
		"ReviewID": "UR30320295",
		"Content": "I thought for$130 a night, the room would have to be SOMEWHAT decent, it was TERRIBLE! My friends and I joked it looked as though a crime took place there!!! Stains on the walls, dirty bath tub, NO updates, bedspreads were dirty (didn't fit the bed) I literally felt sick to my stomach! But there were NO other available rooms in Seattle so we stayed there. I would never in a million years go back to that hotel, even if someone PAID ME!",
		"Date": "May 19, 2009"
	},
	{
		"Ratings": {
			"Service": "3",
			"Cleanliness": "1",
			"Check in / front desk": "3",
			"Overall": "2.0",
			"Value": "1",
			"Rooms": "1",
			"Location": "5"
		},
		"AuthorLocation": "California",
		"Title": "“If I was Austin Powers, the decor would be familiar, but that's about it.”",
		"Author": "expressoparking",
		"ReviewID": "UR21086254",
		"Content": "Hotel Seattle where the sheets have 3 different colors of hair. But that is ok because they were clean on the second day. The bathroom made my friend cringe. She asked if I brought flip flops and sanitizer spray. The dirty shag carpet didn't stop at the wall. It crawled up at least another three inches. I'd give it one star, but I saw The Shining, and that was worse.",
		"Date": "October 22, 2008"
	},
	{
		"Ratings": {
			"Service": "1",
			"Cleanliness": "1",
			"Business service (e.g., internet access)": "1",
			"Check in / front desk": "2",
			"Overall": "1.0",
			"Value": "2",
			"Rooms": "1",
			"Location": "5"
		},
		"AuthorLocation": "Portland, Oregon",
		"Title": "“Great location. Horrible room & unhelpful staff.”",
		"Author": "teamfightingchicken",
		"ReviewID": "UR20669752",
		"Content": "Hotel Seattle is right in the heart of downtown, and is perfect walking distance to anything. The room we stayed in was abominable. It smelled like a thrift store, the pillows and blankets were minute, the bathroom belonged to a truck stop. The tile in the floor was cracked, the vent sounded like a wind tunnel, there was mold in every crease and there was no liner to rank-smelling shower curtain. The staff was unfriendly. The cleaning staff's cart was parked infront of our room's door when we first arrived. The maid watched impassively as we put down our luggage and stuggled to move her cart without offering any assistance as we moved it aside to get into our room. It was a bed for the night near to Seattle's attractions, but that was it.",
		"Date": "October 6, 2008"
	},
	{
		"Ratings": {
			"Service": "3",
			"Cleanliness": "2",
			"Check in / front desk": "4",
			"Overall": "3.0",
			"Value": "4",
			"Rooms": "2",
			"Location": "5"
		},
		"AuthorLocation": "Spokane",
		"Title": "“You get what you pay for”",
		"Author": "cpalawSpokane",
		"ReviewID": "UR20535289",
		"Content": "I had read the reviews before I booked and knew what I was getting into. With that in mind, I wasn't surprised. In fact it was better than we expected. Yes, the rooms are outdated, the towels and floormat were thin, limited cable TV and an overall lack of amenities that one is use to in a US hotel. But as one reviewer said \"it is like a budget overseas hotel\" and I have stayed in several that were in similar condition and I just enjoyed the experience. The check in and desk service was great. We asked for extra pillows from the maid and got them. We also spent $5 for flowers at Pike Street and they added character to the room. Location is everything. Our friends stayed at the Fairmont across the street and we stayed for 3 nights what one night cost them. My money went to dinners, trip to Victoria and baseball games.",
		"Date": "October 1, 2008"
	},
	{
		"Ratings": {
			"Service": "1",
			"Cleanliness": "2",
			"Check in / front desk": "1",
			"Overall": "1.0",
			"Value": "1",
			"Rooms": "1",
			"Location": "4"
		},
		"AuthorLocation": "Bristol",
		"Title": "“Depressing grotty hotel”",
		"Author": "19691972",
		"ReviewID": "UR20452230",
		"Content": "The only good thing about this hotel is the location. We stayed at this hotel for 2 nights before our cruise to Alaska (room only thank goodness). The hotel decor was depressing the sheets were threadbare and the bathroom the pits. They messed up our booking due to the fact that someone there booked us in the previous weekend so when we arrived on the Friday evening at 10.00pm US time (very tired) after a 10 hour flight they said there was no reservation for us. We had no option but to use our credit card to cover a one nights stay until it was sorted. We then had to wake up at 3.00am to phone the travel agent (due to the time difference) to try and sort it. This did not get sorted properly until the Sunday morning when we were due to leave for the cruise. This spoilt our stay in Seattle.",
		"Date": "September 28, 2008"
	},
	{
		"Ratings": {
			"Service": "4",
			"Cleanliness": "3",
			"Check in / front desk": "3",
			"Overall": "3.0",
			"Value": "3",
			"Rooms": "2",
			"Location": "2"
		},
		"AuthorLocation": "Newark",
		"Title": "“Not bad for a sleepover before cruising to Alaska”",
		"Author": "GrandmotherMia",
		"ReviewID": "UR20340043",
		"Content": "We arrived late evening and were only staying overnight before boarding our ship to Alaska. It was modest accommodations and worth the $115 price. Our room was on the 8th floor and had no air conditioning; however, the windows were open to allow for the cool night air. Note that the window have no screens! And, because downtown is very noisy at night, we heard the nighlife from the local clubs and delivery trucks well into the wee hours. Unfortunately, it was not a wonderful location for a restful night's sleep. The restaurant on the lower level offered a WONDERFUL breakfast and allowed us plenty of time to walk to Pike Place Market and enjoy some sightseeing before checking out.",
		"Date": "September 24, 2008"
	},
	{
		"Ratings": {
			"Cleanliness": "2",
			"Check in / front desk": "3",
			"Overall": "1.0",
			"Value": "1",
			"Rooms": "1",
			"Location": "2"
		},
		"AuthorLocation": "Texas",
		"Title": "“It's a dump!”",
		"Author": "fiftee7chevy",
		"ReviewID": "UR19090759",
		"Content": "Hotel Seattle is a seedy, overpriced dump. My wife and I spent three nights there in August 2008. The only real amenity was a color television. The bathroom exhaust vent was so loud we could barely hear the television when the bathroom door was open. The carpet was worn bare. The room had no air-conditioner. Although the first two nights there were pleasant with the windows open for a breeze in the room, the last night was extremely hot and uncomfortable due to a heat wave in Seattle. The hotel had no small fans available for use in our room. In addition, the hotel provided no ice. In fact, the front desk clerk told us we could have all the ice we wanted if we went down the street and bought it at a local convenience store. No hairdryer was provided either. Overall, our experience at this hotel was much less than desirable, especially since the room rate was higher than we usually pay for the usual amenities, i.e., air-conditioning, hair dryer, ice machine, mirror near beds, etc.",
		"Date": "August 18, 2008"
	},
	{
		"Ratings": {
			"Service": "2",
			"Cleanliness": "1",
			"Business service (e.g., internet access)": "1",
			"Check in / front desk": "2",
			"Overall": "1.0",
			"Value": "2",
			"Rooms": "1",
			"Location": "4"
		},
		"AuthorLocation": "Denver",
		"Title": "“Complete Dump”",
		"Author": "GTSDenver",
		"ReviewID": "UR18242318",
		"Content": "While tempting because of a nice, central location and price, unless you don't mind a hotel that has had no updating in over 30 years, including the disgusting orange 70's (used to be shag) carpet in the rooms - stay away! They did a fair job of keeping it clean, they only have so much to work with when the ownership obviously could care less about investing one penny in the property. The room smelled of things not to mention. If you keep the lights off, don't look in the corners, and wear your shoes while in your room at all times, you might be OK. No network available, so impossible for a business traveler. TV doesn't really work.",
		"Date": "July 25, 2008"
	},
	{
		"Ratings": {
			"Service": "5",
			"Cleanliness": "3",
			"Check in / front desk": "5",
			"Overall": "3.0",
			"Value": "3",
			"Rooms": "3",
			"Location": "5"
		},
		"AuthorLocation": "Santa Barbara, CA",
		"Title": "“This Hotel Fit our Bill”",
		"Author": "malarie",
		"ReviewID": "UR17554144",
		"Content": "We stayed in Hotel Seattle for 2 nights and it was fine. It reminded me of the funky less expensive hotel rooms I found in Europe. There was some street parking available (the desk clerk pointed that out to us) during the week (don't know about how crowded it can be on the weekends). And there is a garage right up the street if there isn't any street parking. We were in Seattle for a wedding and wanted an inexpensive hotel downtown that was close to Pike Market, restaurants and other attractions and this fit the bill. The front desk staff was very very friendly helping us find restaurants and directions back to the airport. If you just want a place to sleep (because you'll mostly be out touristing, if you aren't looking for luxury, don't care about matching furniture, or city noises, this hotel is perfect. The beds were clean and comfy and I really liked the pillows. The room was cleaned both days and fresh towels delivered. I read all the previous reviews and was concerned but decided it would be an adventure and if nothing else we would have a good story. But after staying there I realized that expectations really vary amongst guests. We felt safe, slept well, had nice staff encounters. If you want luxury, and newer accommodations, then by all means stay at the \"mocking\" W hotel. But if you were reamed liked we were on the airfare and don't have the money, stay here. Its funky, old, centrally located and has a nice staff. ps. The photographer who shot the lovely photo of the room did and amazing job, and possibly knows a lot about photoshop. Our room paled by comparison. But that's OK",
		"Date": "July 5, 2008"
	},
	{
		"Ratings": {
			"Overall": "1.0"
		},
		"AuthorLocation": "California",
		"Title": "“Beware”",
		"Author": "RiderCalifornia",
		"ReviewID": "UR17238037",
		"Content": "My family and I were traveling to Seattle for the graduation of our niece. This was a special time for us. A member of the family looked on the web for a hotel close to the graduation facility. All looked well on the internet for moderate priced accomodations for three nights. We called them directly and booked the stay. The staff was very nice and none of this review is meant to reflect on the them in any way. We understood that this was a moderate priced placed to stay but did not expect the what we found. The rooms are dark and dank and look like something that comes out of film noir. The bathroom had paper rolling off of the walls; it took two to three flushes for the toilet to flush. it was the most depressing place I have ever stayed in. We knew immediately upon arrival in the room that we could not stay there for 3 nights, so we took steps to find other acommodations and were fortunate to find them. We had to stay one night and I spent that entire time awake. We were at the nearest coffee shop at 5:30 a.m. and left in a taxi by 8:30 a.m. I write this review out of concern for others who plan to stay there. It was not a pleasant experience. Beware.",
		"Date": "June 26, 2008"
	},
	{
		"Ratings": {
			"Service": "4",
			"Cleanliness": "3",
			"Check in / front desk": "5",
			"Overall": "4.0",
			"Value": "4",
			"Rooms": "3",
			"Location": "5"
		},
		"AuthorLocation": "UK",
		"Title": "“Reccommended - Great location and price!”",
		"Author": "lalalalalalalal",
		"ReviewID": "UR8885729",
		"Content": "After struggling to find a hotel with rooms free at a very busy time of year we eventually found the Hotel Seattle. It is in a great location and half the price of most other hotels in the area. The room was clean although the decor was slightly old-fashioned. Staff were friendly and helpful trying to help out with information about the local area at various times of the day and night. If you just want somewhere to sleep and as a base to explore Seattle this hotel is perfect. If you want somehwere a bit more stylish that will charge you at least twice the price then Seattle has plenty of choice!!!",
		"Date": "September 24, 2007"
	},
	{
		"Ratings": {
			"Service": "1",
			"Cleanliness": "1",
			"Business service (e.g., internet access)": "1",
			"Check in / front desk": "1",
			"Overall": "1.0",
			"Value": "1",
			"Rooms": "1",
			"Location": "5"
		},
		"AuthorLocation": "California",
		"Title": "“No customer service”",
		"Author": "hutch30",
		"ReviewID": "UR8862054",
		"Content": "the only good thing was location. the staff was rude, unhelpful, and didn't have knowledge of the area. the tub had black foot prints upon arrival, the towels were old and ratty with holes in them, and the room had a musty smell. the TV only got a clear picture half the time on one channel. the bathroom sink was \"movable\" and the toilet was very small, had exposed pipes. no AC so had to sleep with the windows open and downtown Seattle is extremely noisy at night. only one attendant in the entire hotel at night. would not stay here again!!!!!!!!!!!",
		"Date": "September 23, 2007"
	},
	{
		"Ratings": {
			"Service": "3",
			"Cleanliness": "3",
			"Business service (e.g., internet access)": "1",
			"Check in / front desk": "3",
			"Overall": "2.0",
			"Value": "2",
			"Rooms": "2",
			"Location": "4"
		},
		"AuthorLocation": "Honolulu, Hawaii",
		"Title": "“alright for the price and location”",
		"Author": "hibell",
		"ReviewID": "UR8698929",
		"Content": "for the price i paid...it was okay. spent 2 nights there before going off to family's home about 45 mins away for additional 2 days. didn't want to bother them because we were there for the weekend (wedding). just wanted place to sleep and store belongings while shopping and sightseeing seattle. room run down. very dark - dark brown/dark orange/maroonish color decor. but clean. had running hot water. no problems with bath/toilet...clean and functional. tv sucked though. could only catch 2 stations and they were pretty much snowflaked. got free internet wifi from next door hotel (monaco i think). definitely not elderly or handicap friendly with stairs to get into lobby and no ramp. but i paid for location without breaking my bank account. doubt ill stay there again...i might pay extra 50-75 a night next time around.",
		"Date": "September 12, 2007"
	},
	{
		"Ratings": {
			"Service": "2",
			"Cleanliness": "1",
			"Business service (e.g., internet access)": "1",
			"Check in / front desk": "3",
			"Overall": "1.0",
			"Value": "1",
			"Rooms": "1",
			"Location": "4"
		},
		"AuthorLocation": "Oxford UK",
		"Title": "“Only good thing was location...”",
		"Author": "blackbearOxfordUK",
		"ReviewID": "UR8656807",
		"Content": "The only decent thing about this hotel is the location, which is excellent, I've stayed in better value hostels. The room was dirty, the ceiling plaster had a great chunk missing over the bed and the shower backing was falling off the wall The staff were just not interested. The decor dated from the 1970's and was all various shades of brown, grim and depressing Only stayed one night , then found somewhere else.",
		"Date": "September 5, 2007"
	},
	{
		"Ratings": {
			"Service": "3",
			"Cleanliness": "1",
			"Check in / front desk": "2",
			"Overall": "1.0",
			"Value": "1",
			"Rooms": "1",
			"Location": "5"
		},
		"AuthorLocation": "Boston, Massachusetts",
		"Title": "“Stay in a hostel”",
		"Author": "lizzy018",
		"ReviewID": "UR8190161",
		"Content": "You will have better accommodations. With a name like Hotel Seattle I expected that they would take more pride in their establishment. My room was falling apart. From the baseboard coming off, to the unfinished shower, and not to mention, the unfinished pipes leading into a cut out hole in the floor. In the height of summer there was no A.C. and the only way to get some cool air was to open the window onto the busy street. I will never recommend Hotel Seattle and made sure none of the guest at the wedding I attended will go there either.",
		"Date": "July 19, 2007"
	},
	{
		"Ratings": {
			"Overall": "1.0"
		},
		"AuthorLocation": "Edinburgh",
		"Title": "“Dirty and run down”",
		"Author": "ScoobySuse",
		"ReviewID": "UR5824319",
		"Content": "Thankfully we only stayed one night at the Hotel Seattle. Our room was an absolute disgrace.....very tatty witha layer of dust on most furniture. The bathroom had to be seen to be believed. The bath was old with ingrained dirt, the sink wobbled and leaked at the base. The floor tiles had a few decades ago seen better days. The shower head was loose.............the list is endless. We payed$96 plus tax. For that amount I expected a basic clean room. I have stayed in many hotels over the years and I can truly say that this hotel ranks as the worst I have ever stayed in. Whilst the location is handy for many of the tourist sights, it is not the best area to wander around at night and we felt quite uneasy doing so. I wish I had consulted Trip Advisor before staying there. Stay away!",
		"Date": "September 20, 2006"
	},
	{
		"Ratings": {
			"Cleanliness": "1",
			"Business service (e.g., internet access)": "1",
			"Overall": "1.0",
			"Rooms": "1",
			"Value": "1"
		},
		"AuthorLocation": "San Francisco, California",
		"Title": "“Scary experience all around”",
		"Author": "SueInManzanita",
		"ReviewID": "UR5808628",
		"Content": "The staff was nice. That's about the only nice thing I can say about this place. The photos of the hotel are very misleading. Standing outside looking at the hotel, you have to wonder if the photo on their website has been doctored at all. The photos of the rooms were obviously taken at a different hotel because the room I was put in, and then moved to another looked NOTHING like the room photos on their website. As someone else said in a previous review about this hotel, don't walk around the room without your shoes and socks on. Definitely not a romantic getaway (unless you're trying to break up with someone.) The sheets had hair on them. I requested a non-smoking room, but you could tell that someone had smoked in it previously. There was no air condtioning or a fan. Big deal, it's Seattle, right? Wrong. It was 90 plus degrees during my stay. The windows do open though, providing little relief. Cable television? Non-existant. I was told that sometimes it comes in, and sometimes it doesn't. What does that mean, really? It's sad when you pay $96 a night and can't even get the local channels (NBC, ABC, CBS.) Go on the internet for your news? There is no internet, unless you want to setup your laptop for dialup. The restaurant downstairs was a dive. Again, the service was great, but as with the rooms, you could tell that management didn't quite care about upgrading anything. Several times during my meal, I could have swore I saw something scurrying across the floor. The waitress seemed embarrassed while attempting to relieve me of my worries. I forgot to mention the lobby. The sofa was very comfortable. In fact, it may have been the nicest thing in the entire hotel. However, don't lean your head back while on the sofa or you'll notice that there is paint peeling off the ceiling in large chunks held together by duct tape in places. Speaking of duct tape, there was actually duct tape holding the carpet together in several places. The room I stayed in had scotch tape holding the wallpaper over this gaping hole. Security risk? Room keys have the room number and hotel name on the key ring. So, don't bring anything valuable, because who knows how often the locks are changed and if previous customers have lost their keys on drinking binges in Pioneer Square. There is no room service. It looked like there was only one person there at all times. If you're hungry, don't eat the food in the vending machine. Both the pretzels and Twix candybar were past their expiration date. At check out, staff was apologetic for the things I told them, but obviously not at fault. While you could sense their understandable frustration through their body language (not quite making eye contact, embarrased look on their face), you got the feeling that they hear about similar guest experiences on a regular basis. It's a shame because it's in a great location. You almost wonder if management is even in it to make money. I never did hear back from them after I sent a letter detailing my disappointments. I highly recommend not staying here. Avoid at all costs.",
		"Date": "September 17, 2006"
	},
	{
		"Ratings": {
			"Service": "5",
			"Cleanliness": "3",
			"Check in / front desk": "5",
			"Overall": "4.0",
			"Value": "4",
			"Rooms": "5",
			"Location": "5"
		},
		"AuthorLocation": "los angeles, ca",
		"Title": "“Great value and comfortable!”",
		"Author": "kmter75",
		"ReviewID": "UR5717919",
		"Content": "What a relief! I blindly booked this by calling the hotel - they only had a suite - and got a great rate. Our room was clean (a few carpet stains in corners, no big deal), huge, smoke-free, had a kitchenette (microwave) and was in the middle of downtown. The staff was friendly and helpful, the restaurant attached was excellent for breakfast, comfortable enough beds, and the location was quiet at night. Our room was right next to the elevator, and even that was inaudible! Cons - parking can be a nightmare - its street or city parking garage only, which can be costly ($20/day); not much of a view; some of the floors look like they might not have been updated - ask for one that has (and a suite!); only one elevator for about 11 floors); not too generous on the extra amenities (towels, shampoo, pillows) - if you ask, you get what you need though.",
		"Date": "August 28, 2006"
	},
	{
		"Ratings": {
			"Cleanliness": "1",
			"Overall": "1.0",
			"Value": "1",
			"Service": "2",
			"Rooms": "1"
		},
		"AuthorLocation": "CANADA",
		"Title": "“Trust me, dont come to this hotel, its a nightmare!!”",
		"Author": "A TripAdvisor Member",
		"ReviewID": "UR4446350",
		"Content": "This hotel is realli aweful, is the worse one i had choose from. i stay here just because at that time all hotels are full. therefore i stayed one night at there. Its horrible. u cannot image the carpet is green colour and kinda bug bites. and the ceiling is broken, also, the TV is kinda 1950's one, they should UPGRADE a new one okay? i haven't seen this kinda of OLD TV, and only can watch one or two channels and the colour from that TV is worse. The telephone is realli old. The elevator is worse than ever. and the light whether outside and inside all deem, not dark...realli terrify me to stay at there, its kinda hunting house. the service is not quite good also. do you need to choose cheap hotel, nice and clean one, u should choose 6 Ave Inn, that quite good i stay there for two nights be4 this hotel seattle. realli a nightmare for me. DONT CHOOSE THIS ONE, THE PICTURE IS FAKE...HORRIBLE.",
		"Date": "February 8, 2006"
	},
	{
		"Ratings": {
			"Cleanliness": "2",
			"Overall": "2.0",
			"Value": "3",
			"Service": "3",
			"Rooms": "2"
		},
		"AuthorLocation": "seattle, wa",
		"Title": "“Ok if you just need a place to sleep”",
		"Author": "hizonhizon",
		"ReviewID": "UR4046031",
		"Content": "First off, I will say that this hotel is in a great location, 3 blocks to the pike place market, shopping etc. Second, of course this hotel is located on a hill...all of downtown seattle toward the water is. If you are elderly, you may have issues with this but for most people it will not be an issue. This hotel pretty much only has its location going for it. It is an old hotel, which is pretty rundown. It did have clean sheets, which is basically what we were looking for. Did I walk around barefoot on the carpet or bathroom floor, the answer is no. A little dirty/dingy but ok for a place to sleep. For the price in downtown, its hard to beat. Also, be advised they have no parking (typical for seattle), there are 2 huge parking garages though within a block or two of the hotel so you shouldn't have issues with that.",
		"Date": "October 23, 2005"
	},
	{
		"Ratings": {
			"Cleanliness": "4",
			"Overall": "3.0",
			"Value": "4",
			"Service": "4",
			"Rooms": "4"
		},
		"AuthorLocation": "LA",
		"Title": "“Not bad at all”",
		"Author": "A TripAdvisor Member",
		"ReviewID": "UR3606876",
		"Content": "The location is unmatchable in this price range. A simple sleeping room is $80 but expect to pay 2x's that anywhere else. It was surprisingly cleaner than most hotels I've seen in the past week but I've been driving up from LA and staying at Travelodge and Days Inn and Motel 6. The quality of the furnishings was high. Sure, it's a little run down in spots but it's just an old building with some of the usual character flaws but none affected the comfort. We were lucky enough also to get a corner room so that made it especially nice to look over at the W and know they are paying $250+/night. It had a full bath, everything worked -- we don't care to watch tv anyway on vacation so have no idea how that worked but if you want to believe all the other comments, feel free. It will mean more room for us when we come back.",
		"Date": "June 23, 2005"
	},
	{
		"Ratings": {
			"Cleanliness": "1",
			"Overall": "1.0",
			"Value": "1",
			"Service": "1",
			"Rooms": "1"
		},
		"AuthorLocation": "Denver",
		"Title": "“Dreadful”",
		"Author": "crc11",
		"ReviewID": "UR3499277",
		"Content": "Avoid this hotel at all costs. Even at half the price, it would still be throwing money away. While the location is very desirable, it is in disrepair, ugly, unclean, and generally unpleasant. The toilet in my room malfunctioned daily. The television would only pick up two stations. Although I had a great time with a friend in Seattle, I was happy to leave this hotel. It should not have a star rating at all.",
		"Date": "May 25, 2005"
	},
	{
		"Ratings": {
			"Overall": "2.0"
		},
		"AuthorLocation": "Portland, OR",
		"Title": "“Compares to a motel”",
		"Author": "soledee",
		"ReviewID": "UR2226877",
		"Content": "I don't know how this hotel can get away with a description like: \"All of the guest rooms have been remodeled in a relaxing decor\" (from expedia), when the only thing that seemed to have been updated since the 1970s is the television. There is no room for toiletries in the bathroom, and the tiny pillows were very lumpy. If you don't mind staying at a Super 8 or Motel 6, you should stay here. Otherwise, I suggest you spend a few more bucks and stay elsewhere.",
		"Date": "June 28, 2004"
	},
	{
		"Ratings": {
			"Cleanliness": "2",
			"Overall": "1.0",
			"Value": "1",
			"Service": "3",
			"Rooms": "1"
		},
		"AuthorLocation": "San Jose, Ca.",
		"Title": "“Not a 2 Star Hotel”",
		"Author": "A TripAdvisor Member",
		"ReviewID": "UR1275352",
		"Content": "Pros: Good safe downtown location. Walking distance to market, downtown stores, etc. Room and bathroom were clean. Request the non-smoking floor. Pleasant desk staff. Two coffee places around the corner. Cons: Looks like it hasn't been redecorated since the 1950's. An OK place if you want a simple place to sleep and shower. For the same room rate, the Executive Pacific Plaza (about 1/2 block away) is much nicer.",
		"Date": "September 6, 2003"
	},
	{
		"Ratings": {
			"Overall": "1.0"
		},
		"AuthorLocation": "Colorado",
		"Title": "“Terrible!”",
		"Author": "A TripAdvisor Member",
		"ReviewID": "UR997199",
		"Content": "I've never had a worse experience at a hotel, and I travel a lot for business. The place is a dive...old, dirty and grungy. Not to mention, they charge for services not rendered, and refuse to issue a credit, even in the case of an innocent mistake. Don't waste your time here, not even for their cheap rate!",
		"Date": "May 15, 2003"
	},
	{
		"Ratings": {
			"Overall": "1.0"
		},
		"AuthorLocation": "Palm Desert, CA",
		"Title": "“ramshackle place”",
		"Author": "jawcuda",
		"ReviewID": "UR738929",
		"Content": "Stayed in Hotel Seattle due to last minute trip to Seattle and could only find vacancies at this hotel. Room wouldn't lock easily, bathroom was dirty; no place for toiletries; no cable and poor reception on the few channels you get. Will never stay there again.",
		"Date": "November 3, 2002"
	}],
	"HotelInfo": {
		"Name": "Hotel Seattle",
		"HotelURL": "/ShowUserReviews-g60878-d100506-Reviews-Hotel_Seattle-Seattle_Washington.html",
		"Price": "$96 - $118*",
		"Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">315 Seneca St.</span>, <span class=\"locality\"><span property=\"v:locality\">Seattle</span>, <span property=\"v:region\">WA</span> <span property=\"v:postal-code\">98101</span></span> </span> </span> </address>",
		"HotelID": "100506",
		"ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/7d/22/7d22f3e6c0682df4f389acd30fe4e3d45large.jpg"
	}
}